The pasted selection includes a linked instance of this file '[Name]'. A file cannot link itself, so the link was not pasted.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotPasteCircularLinks { get; }
  Visual Basic
Public Shared ReadOnly Property CannotPasteCircularLinks As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotPasteCircularLinks {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CopyPasteFailures Class
  Autodesk.Revit.DB Namespace